Relation/PhilMath.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Notes on the Helier Robinson's Philosophy of Mathematics</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-08-31 Sat"/>
<meta name="author" content="Greg Dean"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
</head>
<body>
<div id="content">

<h1 class="title">Notes on the Helier Robinson's Philosophy of Mathematics</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Intensional Philosophy of Mathematics </a>
<ul>
<li><a href="#sec-1.1">1.1 Preface </a></li>
<li><a href="#sec-1.2">1.2 Hekergy </a></li>
<li><a href="#sec-1.3">1.3 The Ontological Argument </a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Intensional Philosophy of Mathematics </h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1.1" class="outline-3">
<h3 id="sec-1.1"><span class="section-number-3">1.1</span> Preface </h3>
<div class="outline-text-3" id="text-1.1">


<p>
A <b>PURELY INTENSIONAL MATHEMATICS</b> has two merits:
</p>
<ul>
<li>
Axiom Generosity
</li>
<li>
Freedom from Paradox

</li>
</ul>

<p>Main Problems in the Philosophy of Mathematics
</p>
<ol>
<li>
What is it that determines mathematical inferences,
</li>
</ol>

<p>as if there were a separate Platonic reality which
mathematics describes but cannot alter?
</p>
<ol>
<li>
Why are axiom sets in mathematics so rich in consequences,
</li>
</ol>

<p>so generous with theorems?
</p>
<ol>
<li>
What is the explanation of both the power and the beauty
</li>
</ol>

<p>of mathematics, each of which puts mathematics in an entirely
different category from all other languages?
</p>
<ol>
<li>
What is the difference between mathematical discovery and
</li>
</ol>

<p>mathematical invention? And, whichever is involved, what is
the origin of mathematical novelty?
</p>
<ol>
<li>
Why is mathematics so effective in describing the world?

</li>
<li>
Given our distinction between intensional, extensional,
</li>
</ol>

<p>and nominal mathematics, what is the extent of intensional
mathematics.
</p>
<p>
Here are some answers to the questions above:
</p>
<p>
<i>Mathematical Inferences</i> are based on relations of necessity,
or extrinsic properties that include necessity.
</p>
<p>
<i>Axiom Generosity</i> is due to cascading emergence of relations.
</p>
<p>
Mathematics is <i>Effective In Describing the World</i> because 
reality is relational and mathematics is our language of 
relations. 
</p>
<p>
To explain the power, beauty and novelties of mathematics
we need a concept called <i>hekergy</i>.
</p>
</div>

</div>

<div id="outline-container-1.2" class="outline-3">
<h3 id="sec-1.2"><span class="section-number-3">1.2</span> Hekergy </h3>
<div class="outline-text-3" id="text-1.2">

<p>The concept of hekergy comes from a generalization of
the concept of negative (or negated) entropy.
</p>
<p>
If a relation R emerges with the number <i>e</i> of arrangements
of its term set <i>R</i>, and there are <i>t</i> possible arrangements
of its terms altogether, so that the probability of the
whole defined by R, given <i>R</i>, is the ratio <i>e/t</i>, then
the <b>IMPROBABILITY OF THE WHOLE</b> is the ratio <i>t/e</i>.
</p>
<p>
A measure of the <b>ENTROPY</b>, S-R, of a relation R is
the natural logarithm of the probability of R, ln(e/t);
and a measure of the <b>HEKERGY</b>, H-R, of R, is the
natural logarithm of the improbability of R, ln(t/e).
</p>
<p>
The <b>EMERGENT HEKERGY</b> of a whole is the hekergy of
its top relation.
</p>
<p>
The <b>SUMMATION HEKERGY</b> of a whole is the sum of the
total hekergies of all of the terms and subordinate
terms of its unifying relation.
</p>
<p>
<b>THE PRINCIPLE OF CONSERVATION OF HEKERGY</b> is the
principle that hekergy is neither created nor
destroyed, it is always conserved.
</p>
<p>
The <b>EMERGENT LEVEL</b> of an intrinsic relational
property is the lowest level at which that property
may emerge.
</p>
<p>
<b>THE PRINCIPLE OF NOVEL EMERGENCE</b> is the principle, that,
with some exceptions, every emergent relation has an
emergent level and also that, at that level, it possesses
at least one property not possessed by its terms, or 
by any of its subordinate terms.
</p>
<p>
A <b>FIELD</b> might be defined as a map of how the associated
hekergy changes must occur.
</p>
</div>

</div>

<div id="outline-container-1.3" class="outline-3">
<h3 id="sec-1.3"><span class="section-number-3">1.3</span> The Ontological Argument </h3>
<div class="outline-text-3" id="text-1.3">

<p>The <b>ONTOLOGICAL ARGUMENT</b> is the argument that intensional
mathematical system that exists is the best of all possible
intensional mathematical systems, and that it is exists 
necessarily because it is the best.
</p>
<ul>
<li>
<b>BEST</b> is defined by means of <i>Axiom Generosity</i>.
</li>
<li>
<b>EXISTENCE</b> is defined by means of <i>Logical Consistency</i>.

</li>
</ul>

<p>Intensionally, a <b>MATHEMATICAL ENTITY</b> is any intensional meaning.
</p>
<p>
<b>INTENSIONAL MATHEMATICAL EXISTENCE</b> is possibility: if a
mathematical entity is possible in an intensional mathematical
system then it exists in that system, and if it is not
possible then it does not exist in that system. If the
possibility is singular then the existence is <b>NECESSARY EXISTENCE</b>.
</p>
<p>
A <b>POSSIBLE WORLD</b> is a complete logically possible
mathematical system: everything in it is intrinsically 
possible, and is extrinsically possible with everything
else in it. It is an intensional intrinsically possible
world, but it is called a possible world for short.
</p>
<p>
A possible world has to be <b>COMPLETE</b>: if anything more could
be added to it, that addition would be possible in that
world and so already exists in it.
</p>
<p>
The level of the top relation of a possible world is the
<b>TOP LEVEL</b> of that world.
</p>
<p>
The prime level of relations in a possible world is called
its <b>PRIME AXIOM STRUCTURE</b> or <b>PRIME STRUCTURE</b> for
short. Relations immediately emergent out of the prime
structure are at <i>level two</i>, those next immediately
emergent are at <i>level three</i>, and so on.
</p>
<p>
The totality of relations that emerge cascadingly from a
prime structure is called the <b>CASCADE</b> of that prime
structure.
</p>
<p>
A possible world, unlike other intensional axiomatic
systems, has <b>CIRCULAR SELF-NECESSITATION</b>: the existence
of the top relation extrinsically necessitates the
prime structure of that world (top-down necessitation
(or causation), or distributive existence); and the
prime structure extrinsically necessitates the 
emergent cascade (bottom-up necessitation (or causation),
or compositional existence). 
</p>
<p>
There are two possible definitions of the <b>QUALITY</b> of
a possible world, which are here assumed to be
equivalent; that is equivalent in the sense that 
each is a maximum in the best of all possible worlds.
The first is the numerical value of the top level
of a possible world. The second is the magnitude of
the total cascading hekergy of a possible world,
divided by the number of relations in its axiom
structure. If a world has the highest possible
quality it is called the <b>BEST OF ALL POSSIBLE WORLDS</b>,
and is symbolized by <b>G</b>.
</p>
<p>
Because <b>G</b> has a higher hekergy than any other possible
world, it has maximum possible mathematical beauty.
</p>
<p>
The property that this one intrinsically possible world
has, which thereby renders all others extrinsically
impossible, is called <b>MATHEMATICAL ACTUAL EXISTENCE</b>,
as opposed to the mathematical possible existence
which is intrinsic or extrinsic possibility and
possessed by every possible world. We call this one
world the <b>ACTUAL WORLD</b>.
</p></div>
</div>
</div>
<div id="postamble">
<p class="author"> Author: Greg Dean
<a href="mailto:greg@greg-Satellite-C855D">&lt;greg@greg-Satellite-C855D&gt;</a>
</p>
<p class="date"> Date: 2013-08-31 Sat</p>
<p class="creator">HTML generated by org-mode 6.33x in emacs 23</p>
</div>
</div>
</body>
</html>
